pws-system.org
* edoc-import.el - Importazione Markdown → Org
#+PROPERTY: header-args:emacs-lisp :tangle edoc-import.el

Questa sezione definisce una funzione interattiva per importare un file `.md` dal repository pubblico (`public`)
alla directory corrispondente del repository privato (`private`), convertendolo in Org Mode tramite `pandoc`.

L’operazione è sicura: il file `.org` viene generato solo se non esiste già nella destinazione.

#+BEGIN_SRC emacs-lisp  :tangle edoc-export.el
  ;;; edoc-export.el --- Funzioni di esportazione -*- lexical-binding: t -*-

  (require 'edoc-org-program)
  (defun edoc--org-product-paths (file)
    "Restituisce la lista completa dei path dei file da produrre (in `public/`) per un FILE Org."
    (let* ((base (file-name-base file))
           (relpath (file-relative-name edoc-current-edition-path
                                        (edoc--repo-path "private")))
           (target-dir (expand-file-name relpath (edoc--repo-path "public")))
           (product-line (edoc--read-org-keyword-value file "PRODUCT")))
      (if product-line
          ;; split su virgole e/o spazi, rimuove vuoti
          (let ((names (split-string product-line "[,[:space:]]+" t)))
            (mapcar (lambda (name) (expand-file-name name target-dir)) names))
        ;; default: nome file org -> .md
        (list (expand-file-name (concat base ".md") target-dir)))))

  (defun edoc--product-exists-p (file)
    "Restituisce t se almeno uno dei file prodotti da FILE esiste già."
    (seq-some #'file-exists-p (edoc--org-product-paths file)))


  (defun edoc--read-org-keyword-value (file key)
    "Restituisce il valore della keyword `#+KEY:` nel FILE, oppure nil se assente."
    (when (file-readable-p file)
      (with-temp-buffer
        (insert-file-contents file nil 0 1000)
        (org-mode)
        (goto-char (point-min))
        (when (re-search-forward (concat "^#\\+" (upcase key) ":\\s-*\\(.*\\)$") nil t)
          (string-trim (match-string 1))))))


  (defun edoc--prepend-md-header (md-file header)
    "Aggiunge HEADER (stringa multilinea) in testa a MD-FILE."
    (when (and (file-exists-p md-file)
               (file-writable-p md-file))
      (let ((old-content (with-temp-buffer
                           (insert-file-contents md-file)
                           (buffer-string))))
        (with-temp-file md-file
          (insert header)
          (insert old-content)))))

  (defun edoc-dashboard-publish-file ()
    "Esporta il file Org corrente in Markdown nella directory public, e lo blocca.
        Se esiste `#+PWS_EXPORT:` viene chiamata una funzione personalizzata `edoc-export-org-<label>-to-markdown`.
        Se esiste `#+PRODUCT:` vengono generati più file. Se almeno uno esiste, viene chiesta conferma per sovrascrivere.
        Chiede conferma anche per il blocco del file al termine."
    (interactive)
    (let ((file (get-text-property (point) 'edoc-file))
          (line (line-number-at-pos)))
      (if (not file)
          (message "⚠ Nessun file selezionato.")
        (if (edoc--get-org-lock file)
            (message "❌ Il file è bloccato. Usa `U` per sbloccarlo.")
          (let* ((product-paths (edoc--org-product-paths file))
                 (export-label (edoc--read-org-keyword-value file "PWS_EXPORT")))
            ;; Conferma se esistono già prodotti
            (when (and product-paths
                       (edoc--product-exists-p file)
                       (not (yes-or-no-p "⚠ Alcuni file di destinazione esistono. Sovrascriverli?")))
              (user-error "⛔ Esportazione annullata."))
            ;; Crea directory
            (dolist (p product-paths)
              (let ((dir (file-name-directory p)))
                (unless (file-directory-p dir)
                  (make-directory dir t))))
            ;; Esegue l'esportazione
            (cond
             ;; Personalizzata via PWS_EXPORT
             (export-label
              (let* ((fun-name (intern (format "edoc-export-org-%s-to-markdown" export-label))))
                (if (fboundp fun-name)
                    (progn
                      (funcall fun-name file (car product-paths))
                      (when (yes-or-no-p "🔒 Bloccare il file dopo l'esportazione?")
                        (edoc--set-lock file t))
                      (message "✅ Esportato con `%s`:\n→ %s"
                               export-label
                               (mapconcat #'file-relative-name product-paths "\n→ "))
                      (edoc-dashboard-refresh)
                      (edoc--goto-line line))
                  (message "❌ Funzione export '%s' non trovata." fun-name))))
             ;; Standard via pandoc
             (t
      	    (let* ((vars-path (expand-file-name "vars.org" edoc-current-edition-path)))
      	      (let* ((target-md (car product-paths))
      		     (cmd (format "pandoc -f org -t markdown %s -o %s"
                                    (shell-quote-argument (expand-file-name file))
                                    (shell-quote-argument target-md)))
      		     (output-buf "*edoc-pandoc*"))
                  (with-current-buffer (get-buffer-create output-buf)
                    (erase-buffer))
                  (if (= (call-process-shell-command cmd nil output-buf t) 0)
      		    (progn
      		      (let* ((vars (edoc--combine-org-vars file))
      			     (header (edoc--org-vars-to-md-header vars)))
      			(edoc--prepend-md-header target-md header))
      		      (edoc--write-md5-file product-paths)
      		      (when (yes-or-no-p "🔒 Bloccare il file dopo l'esportazione?")
                          (edoc--set-lock file t))
      		      (message "✅ Esportato con pandoc:\n→ %s"
      			       (mapconcat #'file-relative-name product-paths "\n→ "))
      		      (edoc-dashboard-refresh)
      		      (edoc--goto-line line))
                    (progn
      		    (message "❌ Errore durante l'esportazione con pandoc. Mostro log...")
      		    (display-buffer output-buf))))))))))))

  (defun edoc--read-org-keywords (file)
    "Legge tutte le keyword `#+KEY:` da FILE e restituisce un plist."
    (with-temp-buffer
      (insert-file-contents file nil 0 1000)
      (org-mode)
      (let ((parsed (org-element-parse-buffer))
            result)
        (org-element-map parsed 'keyword
          (lambda (el)
            (let ((key (org-element-property :key el))
                  (val (org-element-property :value el)))
              (when (and key val)
                (setq result (plist-put result
                                        (intern (concat ":" (downcase key)))
                                        (string-trim val)))))))
        result)))

  (defun edoc--combine-org-vars (file)
    "Combina le variabili di vars.org e quelle locali del FILE.
    Le keyword locali sovrascrivono quelle globali. LOCK viene escluso."
    (let* ((vars-file (expand-file-name "vars.org" edoc-current-edition-path))
           (global-vars (edoc-parse-vars vars-file))
           (local-vars (edoc--read-org-keywords file))
           (combined (copy-sequence global-vars)))
      ;; Sovrascrivi le globali con le locali
      (while local-vars
        (let ((key (pop local-vars))
              (val (pop local-vars)))
          (setq combined (plist-put combined key val))))
      ;; Rimuovi LOCK
      (setq combined (edoc--remove-from-plist combined :lock))
      combined))

  (defun edoc--remove-from-plist (plist key)
    "Rimuove la coppia KEY dal PLIST se presente."
    (let (result)
      (while plist
        (let ((k (pop plist))
              (v (pop plist)))
          (unless (eq k key)
            (setq result (plist-put result k v)))))
      result))

  (defun edoc-dashboard-publish-all ()
    "Esporta tutti i file Org abilitati dell’edizione corrente."
    (interactive)
    (let* ((dir edoc-current-edition-path)
           (files (directory-files dir t "\\.org$"))
           (enabled-files (seq-filter #'edoc--get-org-enabled files)))
      (if (null enabled-files)
          (message "⚠ Nessun file abilitato da esportare.")
        (when (yes-or-no-p (format "Esportare %d file abilitati?" (length enabled-files)))
          (dolist (file enabled-files)
            (with-temp-buffer
              (insert-file-contents file nil 0 1000)
              (goto-char (point-min))
              (let ((buf (current-buffer)))
                (let ((inhibit-message t)
                      (edoc--in-batch-export t)) ;; variabile dinamica per silenziare messaggi
                  (let ((buffer (current-buffer)))
                    (with-current-buffer (get-buffer-create "*edoc-export-log*")
                      (goto-char (point-max))
                      (insert (format "\n---\nExporting: %s\n" (file-name-nondirectory file))))
                    ;; imposta proprietà temporanee e chiama la funzione
                    (with-current-buffer (get-buffer "*PWS Dashboard*")
                      (save-excursion
                        (goto-char (point-min))
                        (when (re-search-forward (regexp-quote (file-name-nondirectory file)) nil t)
                          (put-text-property (point-at-bol) (point-at-eol) 'edoc-file file)
                          (goto-char (point-at-bol))
                          (call-interactively #'edoc-dashboard-publish-file)))))))))
          (message "✅ Esportazione batch completata.")
          (display-buffer "*edoc-export-log*")))))

  (provide 'edoc-export)
#+END_SRC
  
#+BEGIN_SRC emacs-lisp  :tangle edoc-import.el
  ;;; edoc-import.el --- Importazione da Markdown a Org -*- lexical-binding: t -*-

  (require 'edoc) ;; usa edoc--repo-path e edoc-current-edition-path

  (defun edoc-import-markdown ()
    "Importa un file Markdown dal repo pubblico a quello privato come file Org, se non esiste già."
    (interactive)
    (let* ((public-root (edoc--repo-path "public"))
           (private-root (edoc--repo-path "private"))
           ;; percorso relativo dell’edizione corrente (es. content/2025/summer)
           (relative-path (file-relative-name edoc-current-edition-path private-root))
           (public-dir (expand-file-name relative-path public-root))
           (private-dir (expand-file-name relative-path private-root))
           (file (read-file-name "Importa markdown: " public-dir nil t nil
                                 (lambda (f) (string-match "\\.md$" f))))
           (basename (file-name-base file))
           (org-file (expand-file-name (concat basename ".org") private-dir)))
      (if (file-exists-p org-file)
          (message "⚠️ Il file %s esiste già nel repository privato." (file-name-nondirectory org-file))
        (unless (file-directory-p private-dir)
          (make-directory private-dir t))
        (let* ((clean-md (make-temp-file "edoc-md-clean" nil ".md")))
  	;; pulizia iniziale: elimina chiavi tipo YAML
  	(with-temp-buffer
  	  (insert-file-contents file)
  	  (goto-char (point-min))
  	  ;; Rimuove le righe iniziali tipo chiave: valore fino alla prima riga vuota
  	  (while (and (not (eobp))
  		      (looking-at-p "[^[:space:]]+:"))
  	    (kill-whole-line))
  	  ;; Se la riga successiva è vuota, toglila pure
  	  (when (looking-at-p "^\\s-*$")
  	    (kill-whole-line))
  	  ;; Scrivi su file temporaneo
  	  (write-region (point-min) (point-max) clean-md))
  	;; Ora lancia pandoc sul file temporaneo pulito

  	;; Aspetta fino a 30 secondi che il file sia leggibile
  	(let ((waited 0))
  	  (while (and (not (file-readable-p clean-md))
  		      (< waited 30))
  	    (sleep-for 0.1)
  	    (setq waited (+ waited 0.1))))

  	(if (not (file-readable-p clean-md))
  	    (message "❌ File temporaneo non pronto dopo 30 secondi.")
  	(let ((cmd (format "pandoc -f markdown -t org %s -o %s"
  			   (shell-quote-argument clean-md)
  			   (shell-quote-argument (expand-file-name org-file)))))
  	  (if (= (shell-command cmd) 0)
  	      (progn
  		(message "✅ Importato e convertito: %s → %s"
  			 (file-name-nondirectory file)
  			 (file-name-nondirectory org-file))
  		(sit-for 0.5)
  		(edoc-dashboard-refresh))
  	    (message "❌ Errore durante la conversione con pandoc."))))))))

  (provide 'edoc-import)
#+END_SRC



#+BEGIN_SRC emacs-lisp  :tangle edoc-import.el
    (defun edoc--write-md5-file (paths)
      "Scrive l'MD5 della concatenazione dei contenuti dei file in PATHS in un file nascosto `.nome.md5`.
    Usa il primo file per determinare il nome dell'hash file."
      (when paths
        (let* ((combined
                (mapconcat (lambda (p)
                             (when (file-readable-p p)
                               (with-temp-buffer
                                 (insert-file-contents p)
                                 (buffer-string))))
                           paths
                           ""))
               (md5-hash (md5 combined))
               (hash-file (concat (file-name-directory (car paths))
                                  "." (file-name-nondirectory (car paths))
                                  ".md5")))
          (with-temp-file hash-file
            (insert md5-hash))
          hash-file)))

    (defun edoc--md5-up-to-date-p (paths)
      "Restituisce t se il contenuto MD5 dei PATHS corrisponde al valore nel file `.nome.md5`."
      (when paths
        (let* ((first-file (car paths))
               (hash-file (concat (file-name-directory first-file)
                                  "." (file-name-nondirectory first-file)
                                  ".md5")))
          (when (and (file-exists-p hash-file)
                     (file-readable-p hash-file))
            (let* ((actual-md5 (md5 (mapconcat
                                     (lambda (p)
                                       (with-temp-buffer
                                         (insert-file-contents p)
                                         (buffer-string)))
                                     paths "")))
                   (stored-md5 (with-temp-buffer
                                 (insert-file-contents hash-file)
                                 (string-trim (buffer-string)))))
              (string= actual-md5 stored-md5))))))

    (defun edoc--org-product-paths (file)
    "Restituisce la lista completa dei path dei file Markdown da produrre per FILE Org.

  Se il file contiene la keyword `#+PRODUCT:`, i nomi elencati vengono usati.
  Altrimenti viene usato il nome base del file con estensione `.md`, nella directory public."
    (let* ((base (file-name-base file))
           (relpath (file-relative-name edoc-current-edition-path
                                        (edoc--repo-path "private")))
           (target-dir (expand-file-name relpath (edoc--repo-path "public")))
           (product-line (edoc--read-org-keyword-value file "PRODUCT")))
      (if product-line
          ;; Split su virgole e/o spazi, rimuove stringhe vuote
          (let ((names (split-string product-line "[,[:space:]]+" t)))
            (mapcar (lambda (name)
                      (expand-file-name name target-dir))
                    names))
        ;; Default: nome del file .org → .md
        (list (expand-file-name (concat base ".md") target-dir)))))

  (defun edoc--read-org-keyword-value (file key)
  "Restituisce il valore della keyword `#+KEY:` nel FILE, oppure nil se assente."
  (when (file-readable-p file)
    (with-temp-buffer
      (insert-file-contents file nil 0 1000)
      (org-mode)
      (goto-char (point-min))
      (when (re-search-forward (concat "^#\\+" (upcase key) ":\\s-*\\(.*\\)$") nil t)
        (string-trim (match-string 1))))))

#+END_SRC
